4) sythetic tests/1) regular allocator/fio.txt
 19:44:17 /mnt/rotalloc 🭬
fio --name=seqwrite --directory=. --rw=write --bs=1M --numjobs=6 --size=4G --runtime=300 --time_based --group_reporting
seqwrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
...
fio-3.37
Starting 6 processes
Jobs: 1 (f=1): [_(2),W(1),_(3)][100.0%][w=95.0MiB/s][w=95 IOPS][eta 00m:00s]
seqwrite: (groupid=0, jobs=6): err= 0: pid=3831: Thu Feb 26 19:49:19 2026
  write: IOPS=496, BW=497MiB/s (521MB/s)(146GiB/301516msec); 0 zone resets
    clat (usec): min=74, max=33697k, avg=9191.89, stdev=212264.89
     lat (usec): min=81, max=33697k, avg=9211.07, stdev=212264.85
    clat percentiles (usec):
     |  1.00th=[    116],  5.00th=[    125], 10.00th=[    153],
     | 20.00th=[    157], 30.00th=[    161], 40.00th=[    169],
     | 50.00th=[    174], 60.00th=[    188], 70.00th=[    277],
     | 80.00th=[    668], 90.00th=[  28967], 95.00th=[  34866],
     | 99.00th=[  63177], 99.50th=[ 175113], 99.90th=[ 208667],
     | 99.95th=[ 208667], 99.99th=[5469373]
   bw (  KiB/s): min=12288, max=11736199, per=100.00%, avg=838180.19, stdev=162619.28, samples=2194
   iops        : min=   12, max=11457, avg=818.52, stdev=158.79, samples=2194
  lat (usec)   : 100=0.13%, 250=69.40%, 500=6.80%, 750=4.34%, 1000=0.06%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.23%, 20=1.49%, 50=15.81%
  lat (msec)   : 100=1.05%, 250=0.62%, 500=0.01%, 750=0.01%, 2000=0.02%
  lat (msec)   : >=2000=0.01%
  cpu          : usr=0.10%, sys=2.08%, ctx=46304, majf=2, minf=64
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,149712,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=497MiB/s (521MB/s), 497MiB/s-497MiB/s (521MB/s-521MB/s), io=146GiB (157GB), run=301516-301516msec

Disk stats (read/write):
  nvme0n1: ios=8/1171681, sectors=80/299890528, merge=0/647, ticks=1330/36437077, in_queue=36461221, util=99.43%
 marek@ideacentre 🭬🭨/mnt/rotalloc 🭬
 READY▪🭬

*************************************

 19:58:19 /mnt/rotalloc 🭬
fio --name=smallfiles --directory=. --rw=write --bs=4k --numjobs=6 --size=1G --ioengine=psync --time_based --runtime=180 --group_reporting
smallfiles: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37
Starting 6 processes
Jobs: 1 (f=1): [_(5),W(1)][100.0%][eta 00m:00s]                              
smallfiles: (groupid=0, jobs=6): err= 0: pid=5396: Thu Feb 26 20:01:55 2026
  write: IOPS=181k, BW=707MiB/s (742MB/s)(149GiB/215667msec); 0 zone resets
    clat (nsec): min=748, max=30455k, avg=2033.35, stdev=65003.18
     lat (nsec): min=779, max=30455k, avg=2065.89, stdev=65012.95
    clat percentiles (nsec):
     |  1.00th=[ 1320],  5.00th=[ 1336], 10.00th=[ 1336], 20.00th=[ 1352],
     | 30.00th=[ 1368], 40.00th=[ 1384], 50.00th=[ 1416], 60.00th=[ 1480],
     | 70.00th=[ 1576], 80.00th=[ 1704], 90.00th=[ 1992], 95.00th=[ 2480],
     | 99.00th=[ 3792], 99.50th=[ 4128], 99.90th=[ 8768], 99.95th=[14528],
     | 99.99th=[77312]
   bw (  MiB/s): min=  207, max=12158, per=100.00%, avg=5752.56, stdev=572.98, samples=320
   iops        : min=53028, max=3112466, avg=1472655.63, stdev=146683.00, samples=320
  lat (nsec)   : 750=0.01%, 1000=0.46%
  lat (usec)   : 2=89.67%, 4=9.25%, 10=0.54%, 20=0.03%, 50=0.01%
  lat (usec)   : 100=0.04%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=0.86%, sys=7.21%, ctx=143907, majf=0, minf=65
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,39059462,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=707MiB/s (742MB/s), 707MiB/s-707MiB/s (742MB/s-742MB/s), io=149GiB (160GB), run=215667-215667msec

Disk stats (read/write):
  nvme0n1: ios=46/1228907, sectors=1552/312503296, merge=143/630, ticks=178/15457654, in_queue=15462260, util=99.08%
 marek@ideacentre 🭬🭨/mnt/rotalloc 🭬
 READY▪🭬

*************************************

 19:51:56 /mnt/rotalloc 🭬
fio --name=allocstress     --directory=.     --rw=write     --bs=4k     --numjobs=48     --size=2G     --ioengine=psync     --time_based     --runtime=180     --group_reporting
allocstress: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37
Starting 48 processes
Jobs: 48 (f=48): [W(48)][100.0%][w=58.3MiB/s][w=14.9k IOPS][eta 00m:00s]
allocstress: (groupid=0, jobs=48): err= 0: pid=4158: Thu Feb 26 19:54:57 2026
  write: IOPS=42.4k, BW=166MiB/s (174MB/s)(29.1GiB/180103msec); 0 zone resets
    clat (nsec): min=1316, max=520947k, avg=1130543.85, stdev=10913654.20
     lat (nsec): min=1353, max=520948k, avg=1130676.44, stdev=10913746.17
    clat percentiles (nsec):
     |  1.00th=[     1512],  5.00th=[     1704], 10.00th=[     1816],
     | 20.00th=[     1960], 30.00th=[     2128], 40.00th=[     2320],
     | 50.00th=[     2480], 60.00th=[     2672], 70.00th=[     2928],
     | 80.00th=[     3216], 90.00th=[     3632], 95.00th=[     4960],
     | 99.00th=[ 71827456], 99.50th=[103284736], 99.90th=[115867648],
     | 99.95th=[137363456], 99.99th=[208666624]
   bw (  KiB/s): min=13472, max=8463628, per=100.00%, avg=170130.27, stdev=12433.60, samples=17232
   iops        : min= 3368, max=2115900, avg=42529.93, stdev=3108.40, samples=17232
  lat (usec)   : 2=23.00%, 4=69.54%, 10=5.95%, 20=0.16%, 50=0.10%
  lat (usec)   : 100=0.05%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.03%, 50=0.04%
  lat (msec)   : 100=0.56%, 250=0.54%, 500=0.01%, 750=0.01%
  cpu          : usr=0.04%, sys=0.26%, ctx=108020, majf=0, minf=581
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7639228,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=166MiB/s (174MB/s), 166MiB/s-166MiB/s (174MB/s-174MB/s), io=29.1GiB (31.3GB), run=180103-180103msec

Disk stats (read/write):
  nvme0n1: ios=615/198446, sectors=19400/50524952, merge=737/2908, ticks=13412/21179307, in_queue=21206389, util=98.03%
 marek@ideacentre 🭬🭨/mnt/rotalloc 🭬
 READY▪🭬